# EmbeddedDefinition Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewSchedule..::..EmbeddedDefinition Property
ViewSchedule Class See Also
---
The embedded ScheduleDefinition.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ScheduleDefinition EmbeddedDefinition { get; }
```

Visual Basic
---
```text
Public ReadOnly Property EmbeddedDefinition As ScheduleDefinition
	Get
```

Visual C++
---
```text
public:
property ScheduleDefinition^ EmbeddedDefinition {
	ScheduleDefinition^ get ();
}
```

# See Also
ViewSchedule Class
Autodesk.Revit.DB Namespace